Repository: gabrielluis21/intelliresume
Catalog: lib/l10n/app_*.arb
Languages: pt

# historyPage_anErrorOccurred
source: An error occurred: {error}
pt: Ocorreu um erro: {error}

# historyPage_noSavedResumes
source: No saved resumes.
pt: Nenhum currículo salvo.

# historyPage_createNewResumeToStart
source: Create a new resume to start.
pt: Crie um novo currículo para começar.

# historyPage_untitledResume
source: Untitled Resume
pt: Currículo sem título

# historyPage_updatedOn
source: Updated on: {date}
pt: Atualizado em: {date}

# historyPage_newResume
source: New Resume
pt: Novo Currículo

# profilePage_userNotFound
source: User not found.
pt: Usuário não encontrado.

# profilePage_errorLoadingProfile
source: Error loading profile: {error}
pt: Erro ao carregar perfil: {error}

# profilePage_profilePictureSemanticLabel
source: Profile picture of {userName}
pt: Foto de perfil de {userName}

# profilePage_avatarSemanticLabel
source: Avatar with initial of name {userName}
pt: Avatar com a inicial do nome {userName}

# profilePage_defaultUserName
source: User
pt: Usuário

# profilePage_defaultEmail
source: email@example.com
pt: email@exemplo.com

# profilePage_mySubscription
source: My Subscription
pt: Minha Assinatura

# profilePage_premiumPlanStarIconSemanticLabel
source: Star icon for Premium plan
pt: Ícone de estrela do plano Premium

# profilePage_freePlanCheckIconSemanticLabel
source: Check icon for Free plan
pt: Ícone de check do plano gratuito

# profilePage_premiumPlan
source: Premium Plan
pt: Plano Premium

# profilePage_freePlan
source: Free Plan
pt: Plano Gratuito

# profilePage_premiumPlanDescription
source: You have access to all features.
pt: Você tem acesso a todos os recursos.

# profilePage_freePlanDescription
source: Access more features by upgrading.
pt: Acesse mais recursos fazendo o upgrade.

# profilePage_upgrade
source: Upgrade
pt: Fazer Upgrade

# profilePage_quickActions
source: Quick Actions
pt: Ações Rápidas

# profilePage_editIconSemanticLabel
source: Pencil icon
pt: Ícone de lápis

# profilePage_editProfile
source: Edit Profile
pt: Editar Perfil

# profilePage_historyIconSemanticLabel
source: Clock icon
pt: Ícone de relógio

# profilePage_viewResumeHistory
source: View Resume History
pt: Ver Histórico de Currículos

# profilePage_settingsIconSemanticLabel
source: Gear icon
pt: Ícone de engrenagem

# profilePage_settings
source: Settings
pt: Configurações

# aiAssistant_freePlanLimitReached
source: AI interaction limit reached on free plan.
pt: Limite de interações com IA atingido no plano gratuito.

# aiAssistant_emptyResumeWarning
source: Your resume is empty. Add content to use AI.
pt: Seu currículo está vazio. Adicione conteúdo para usar a IA.

# aiAssistant_recruitmentExpertPrompt
source: You are a recruitment expert. Analyze the following resume: {resumeContent}
pt: Você é um especialista em recrutamento. Analise o seguinte currículo: {resumeContent}

# aiAssistant_errorContactingAI
source: An error occurred contacting AI: {error}
pt: Ocorreu um erro ao contatar a IA: {error}

# aiAssistant_translate
source: Translate
pt: Traduzir

# aiAssistant_strengthsAndWeaknesses
source: Strengths and Weaknesses
pt: Pontos fortes e fracos

# aiAssistant_spellCheck
source: Spell Check
pt: Correção ortográfica

# aiAssistant_generateResume
source: Generate resume
pt: Gerar currículo

# aiAssistant_expand
source: Expand
pt: Expandir

# aiAssistant_emptyResumePlaceholder
source: Your resume is empty. Add sections and content to see it here.
pt: Seu currículo está vazio. Adicione seções e conteúdo para vê-lo aqui.

# cvCard_draft
source: Draft
pt: Rascunho

# cvCard_editResume
source: Edit resume
pt: Editar currículo

# cvCard_deleteResume
source: Delete resume
pt: Excluir currículo

# cvCard_createdOn
source: Created on: {date}
pt: Criado em: {date}

# cvCard_evaluation
source: Evaluation: {evaluation}
pt: Avaliação: {evaluation}

# cvCard_translation
source: Translation: {translation}
pt: Tradução: {translation}

# cvCard_corrections
source: Corrections: {count}
pt: Correções: {count}

# resumeForm_aboutMeTab
source: About Me
pt: Sobre Mim

# resumeForm_objectiveTab
source: Objective
pt: Objetivo

# resumeForm_experienceTab
source: Experience
pt: Experiência

# resumeForm_educationTab
source: Education
pt: Educação

# resumeForm_skillsTab
source: Skills
pt: Habilidades

# resumeForm_projectsTab
source: Projects
pt: Projetos

# resumeForm_certificatesTab
source: Certificates
pt: Certificados

# resumeForm_accessibilityTab
source: Accessibility
pt: Acessibilidade

# resumeForm_previous
source: Previous
pt: Anterior

# resumeForm_next
source: Next
pt: Próximo

# resumeForm_itemCount
source: {itemLabel} {currentIndex} of {totalItems}
pt: {itemLabel} {currentIndex} de {totalItems}

# resumeForm_professionalObjective
source: Professional Objective
pt: Objetivo Profissional

# resumeForm_training
source: Training
pt: Formação

# resumeForm_skill
source: Skill
pt: Habilidade

# resumeForm_socialLink
source: Social Link
pt: Link Social

# resumeForm_project
source: Project
pt: Projeto

# resumeForm_certificate
source: Certificate
pt: Certificado

# resumeForm_accessibilitySettings
source: Accessibility Settings
pt: Configurações de Acessibilidade

# resumeForm_includePCDInfo
source: Include disability info in the resume
pt: Incluir informações de PCD no currículo

# resumeForm_includePCDInfoSubtitle
source: Select to include disability information from your profile in the resume.
pt: Selecione para incluir as informações de deficiência do seu perfil no currículo.

# resumeForm_fillYourResume
source: Fill your resume
pt: Preencha seu currículo

# resumeForm_noItemAdded
source: No {itemLabel} added.
pt: Nenhum(a) {itemLabel} adicionado(a).

# resumeForm_add
source: Add New {itemLabel}
pt: Adicionar Novo(a) {itemLabel}

# resumeForm_removeCurrent
source: Remove Current {itemLabel}
pt: Remover {itemLabel} Atual

# languageSelector_selectLanguage
source: Select Language:
pt: Selecione o Idioma:

# languageSelector_english
source: 🇺🇸 English
pt: 🇺🇸 Inglês

# languageSelector_spanish
source: 🇪🇸 Spanish
pt: 🇪🇸 Espanhol

# languageSelector_french
source: 🇫🇷 French
pt: 🇫🇷 Francês

# languageSelector_german
source: 🇩🇪 German
pt: 🇩🇪 Alemão

# layoutTemplate_openNavigationMenu
source: Open navigation menu
pt: Abrir menu de navegação

# aboutMeForm_save
source: Save
pt: Salvar

# aboutMeForm_removeAboutMe
source: Remove About Me
pt: Remover Sobre Mim

# contactSection_title
source: Contact
pt: Contato

# contactSection_description
source: Have questions, suggestions, or need support? Get in touch!
pt: Tem alguma dúvida, sugestão ou precisa de suporte? Entre em contato conosco!

# contactSection_emailSemanticLabel
source: Contact email: support@intelliresume.com
pt: E-mail de contato: suporte@intelliresume.com

# contactSection_chatSupportLabel
source: Chat Support
pt: Suporte via Chat

# contactSection_chatSupportAvailability
source: Available Mon-Fri, 9am to 6pm
pt: Disponível de Seg. a Sex. das 9h às 18h

# heroTitle
source: Build your resume with intelligence!
pt: Monte seu currículo com inteligência!

# heroSubtitle
source: Use AI to build, translate, and improve your resume based on the desired country.
pt: Use IA para montar, traduzir e melhorar seu currículo com base no país desejado.

# heroCTA
source: Try it now
pt: Experimente agora

# heroLogoSemanticLabel
source: IntelliResume Logo
pt: Logo do IntelliResume

# webLandingPage_logoSemanticLabel
source: IntelliResume Logo
pt: Logo do IntelliResume

# webLandingPage_openAccessibilityMenuSemanticLabel
source: Open accessibility and settings menu
pt: Abrir menu de configurações e acessibilidade

# webLandingPage_accessibilityTooltip
source: Settings and Accessibility
pt: Configurações e Acessibilidade

# webLandingPage_aboutButton
source: About
pt: Sobre

# webLandingPage_featuresButton
source: Features
pt: Recursos

# webLandingPage_plansButton
source: Plans
pt: Planos

# webLandingPage_contactButton
source: Contact
pt: Contato

# webLandingPage_loginButtonSemanticLabel
source: Go to login page
pt: Ir para a página de login

# webLandingPage_loginButton
source: Login
pt: Entrar

# webLandingPage_signUpAndBuyButton
source: Sign Up and Buy
pt: Cadastrar e Comprar

# webLandingPage_scrollToSectionSemanticLabel
source: Go to section {label}
pt: Ir para a seção {label}

# webLandingPage_accessibilityDrawerTitle
source: Settings and Accessibility
pt: Configurações e Acessibilidade

# webLandingPage_visualAdjustmentsTitle
source: Visual Adjustments
pt: Ajustes Visuais

# webLandingPage_highContrast
source: High Contrast
pt: Alto Contraste

# webLandingPage_boldText
source: Bold Text
pt: Texto em Negrito

# webLandingPage_fontSize
source: Font Size
pt: Tamanho da Fonte

# webLandingPage_fontScale
source: Scale: {scale}x
pt: Escala: {scale}x

# webLandingPage_languageAndRegionTitle
source: Language and Region
pt: Idioma e Região

# webLandingPage_portuguese
source: 🇧🇷 Portuguese (Brazil)
pt: 🇧🇷 Português (Brasil)

# webLandingPage_additionalFeaturesTitle
source: Additional Features
pt: Recursos Adicionais

# webLandingPage_librasVersion
source: Libras Version (VLibras)
pt: Versão em Libras (VLibras)

# pricing_featureIncluded
source: Feature included
pt: Recurso incluído

# pricing_yourCurrentPlan
source: Your Current Plan
pt: Seu Plano Atual

# pricing_notAvailable
source: Not Available
pt: Não disponível

# demoSection_title
source: See IntelliResume in Action
pt: Veja o IntelliResume em Ação

# demoSection_subtitle
source: Discover how our platform can transform your resume.
pt: Descubra como nossa plataforma pode transformar seu currículo.

# demoSection_text
source: Watch a quick demonstration of IntelliResume's powerful features. From AI-powered suggestions to professional templates, see how easy it is to create a standout resume.
pt: Assista a uma rápida demonstração dos poderosos recursos do IntelliResume. Desde sugestões com IA até modelos profissionais, veja como é fácil criar um currículo de destaque.

# demoSection_cta
source: Watch Demo
pt: Assistir Demonstração

# demoSection_ctaSemanticLabel
source: Watch a demonstration video of IntelliResume
pt: Assistir a um vídeo de demonstração do IntelliResume

# demoSection_mockupPlaceholder
source: App Mockup Placeholder
pt: Placeholder do Mockup do Aplicativo

# testimonialsSection_title
source: What Our Users Say
pt: O que nossos usuários dizem

# testimonialsSection_subtitle
source: Success stories that inspire us.
pt: Histórias de sucesso que nos inspiram.

# ctaSection_title
source: Stand out in the market with a real resume.
pt: Destaque-se no mercado com um currículo de verdade.

# ctaSection_button
source: Create My Resume Now
pt: Criar Meu Currículo Agora

# ctaSection_buttonSemanticLabel
source: Create your resume now button
pt: Botão criar meu currículo agora

# featuresSection_title
source: Intelligent Features
pt: Funcionalidades Inteligentes

# featuresSection_subtitle
source: Everything you need to create a standout resume in minutes.
pt: Tudo o que você precisa para criar um currículo de destaque em minutos.

# feature_aiEvaluation_title
source: AI-Powered Evaluation
pt: Avaliação com IA

# feature_aiEvaluation_description
source: Get suggestions to make your resume more impactful and professional.
pt: Receba sugestões para tornar seu currículo mais impactante e profissional.

# feature_autoTranslation_title
source: Automatic Translation
pt: Tradução Automática

# feature_autoTranslation_description
source: Adapt your resume for international jobs with translation into multiple languages.
pt: Adapte seu currículo para vagas internacionais com tradução para múltiplos idiomas.

# feature_spellCheck_title
source: Spell Check
pt: Correção Ortográfica

# feature_spellCheck_description
source: Avoid grammatical errors that could cost you an opportunity. We review it for you.
pt: Evite erros gramaticais que podem custar uma oportunidade. Nós revisamos para você.

# feature_professionalTemplates_title
source: Professional Templates
pt: Modelos Profissionais

# feature_professionalTemplates_description
source: Choose from dozens of free and premium templates created by experts.
pt: Escolha entre dezenas de modelos gratuitos e premium, criados por especialistas.

# feature_studioMode_title
source: Studio Mode (Pro)
pt: Modo Estúdio (Pro)

# feature_studioMode_description
source: Customize colors, fonts, and layouts to create a truly unique resume.
pt: Personalize cores, fontes e layouts para criar um currículo verdadeiramente único.

# feature_easyExport_title
source: Easy Export
pt: Exportação Fácil

# feature_easyExport_description
source: Export your resume in high-quality PDF format, ready to be sent.
pt: Exporte seu currículo em formato PDF com alta qualidade, pronto para ser enviado.
