Repository: gabrielluis21/intelliresume
Catalog: lib/l10n/app_*.arb
Languages: pt

source: About Me
pt: Sobre Mim

# aboutMeEmptyPlaceholder
source: Write a brief summary about yourself...
pt: Faça um breve resume sobre si...

# plansTitle
source: Plans and Prices
pt: Planos e Preços

# planFreeTitle
source: Free
pt: Gratuito

# planFreeDetailsShort
source: Create your resume with basic templates.
pt: Crie seu currículo com modelos básicos.

# planPremiumDetailsShort
source: Access premium templates and AI features.
pt: Acesse modelos premium e recursos de IA.

# contactTitle
source: Contact
pt: Contato

# objectivesEmptyPlaceholder
source: Your professional objectives will appear here.
pt: Seus objetivos profissionais aparecerão aqui.

# contactSubtitle
source: Have questions, suggestions, or need support? Get in touch!
pt: Tem alguma dúvida, sugestão ou precisa de suporte? Entre em contato conosco!

source: No Experience
pt: Nenhuma experiência

source: No Objectives
pt: Nenhum objetivo

# noSkill
source: No Skills
pt: Nenhuma habilidade

# noSocialLink
source: No Social Links
pt: Nenhum link social

# chatSupportLabel
source: Chat Support
pt: Suporte via Chat

# chatSupportAvailability
source: Available Mon-Fri, 9am to 6pm
pt: Disponível de Seg. a Sex. das 9h às 18h

source: No Educations
pt: Nenhuma Educação

source: Social Links
pt: Links Sociais

source: Experiences
pt: Experiências

source: Educations
pt: Educações

source: Skills
pt: Habilidades

source: Objective
pt: Objetivo

source: Certificates
pt: Certificados

source: Projects
pt: Projetos

# passwordsDontMatch
source: Passwords do not match.
pt: As senhas não coincidem.

# fieldRequired
source: This field is required.
pt: Este campo é obrigatório.

# invalidEmail
source: Invalid email address.
pt: Endereço de e-mail inválido.

# passwordTooShort
source: Password must be at least 6 characters long.
pt: A senha deve ter no mínimo 6 caracteres.

source: Sign Up
pt: Cadastre-se

# login
source: Sign In
pt: Entrar

source: Sign Out
pt: Sair

source: Password
pt: Senha

# confirmPass
source: Confirm Password
pt: Confirmar Senha

source: No History
pt: Sem Histórico

source: History
pt: Histórico

# formTitle
source: Fill the form
pt: Preencha o formulário

source: Save
pt: Salvar

source: Cancel
pt: Cancelar

# forgetPassword
source: Forgot Password?
pt: Esqueci minha senha

# aboutIntelliTitle
source: About IntelliResume
pt: Sobre o IntelliResume

# aboutIntelliDescription
source: IntelliResume was born from the need to simplify and optimize resume creation for an increasingly global and competitive job market. Our platform uses Artificial Intelligence to help you build an impactful resume, adapted to different countries and cultures, and professionally translated. We want you to stand out and land your dream job, wherever it may be.
pt: O IntelliResume nasceu da necessidade de simplificar e otimizar a criação de currículos para um mercado de trabalho cada vez mais global e competitivo. Nossa plataforma utiliza Inteligência Artificial para ajudar você a construir um currículo impactante, adaptado para diferentes países e culturas, e traduzido profissionalmente. Queremos que você se destaque e conquiste a vaga dos seus sonhos, onde quer que ela esteja.

source: Preview
pt: Visualizar

# premiumSuccess
source: Premium plan activated successfully!
pt: Plano Premium ativado com sucesso!

# errorPrefix
source: Error:
pt: Erro:

# profileUpdateSuccess
source: Profile updated successfully!
pt: Perfil atualizado com sucesso!

# profileUpdateError
source: Error updating profile:
pt: Erro ao atualizar perfil:

# iAmPCD
source: I wish to inform that I am a person with a disability
pt: Desejo informar que sou PCD

source: Generate and Preview PDF
pt: Gerar e Visualizar PDF

# pdfGenerationError
source: Error generating PDF:
pt: Erro ao gerar PDF:

source: Premium Template
pt: Template Premium

source: Close
pt: Fechar

source: View Plans
pt: Ver Planos

# selectLanguage
source: Select a language...
pt: Selecione um idioma...

source: PDF Preview
pt: Preview PDF

source: My Resumes
pt: Meus Currículos

source: An error occurred:
pt: Ocorreu um erro:

source: No saved resumes.
pt: Nenhum currículo salvo.

source: Updated on:
pt: Atualizado em:

source: New Resume
pt: Novo Currículo

source: Hello!
pt: Olá!

source: Your Resumes
pt: Seus Currículos

source: Could not load resumes.
pt: Não foi possível carregar os currículos.

source: Quick Actions
pt: Ações Rápidas

source: User not found.
pt: Usuário não encontrado.

source: Upgrade
pt: Fazer Upgrade

source: Edit Profile
pt: Editar Perfil

source: View Resume History
pt: Ver Histórico de Currículos

source: Settings
pt: Configurações

# resumeLoadError
source: Failed to load resume:
pt: Falha ao carregar o currículo:

source: View Resume
pt: Visualizar Currículo

source: Resume Editor
pt: Editor de Currículo

source: Manage Account
pt: Gerenciar Conta

# manageAccountSubtitle
source: Change your profile information
pt: Altere suas informações de perfil

source: Change Password
pt: Alterar Senha

# notImplemented
source: Feature to be implemented.
pt: Funcionalidade a ser implementada.

source: Manage Subscription
pt: Gerenciar Assinatura

# manageSubscriptionSubtitle
source: View your plan details
pt: Veja os detalhes do seu plano

source: Theme
pt: Tema

source: Language
pt: Idioma

# helpCenter
source: Help Center (FAQ)
pt: Central de Ajuda (FAQ)

source: Terms of Service
pt: Termos de Serviço

source: Privacy Policy
pt: Política de Privacidade

source: Licenses
pt: Licenças

# logout
source: Sign Out (Logout)
pt: Sair (Logout)

source: Delete Account
pt: Excluir Conta

source: Select Theme
pt: Selecionar Tema

source: Light
pt: Claro

source: Dark
pt: Escuro

source: System Default
pt: Padrão do Sistema

# selectLanguageTitle
source: Select Language
pt: Selecionar Idioma

# portuguese
source: 🇧🇷 Portuguese (Brazil)
pt: 🇧🇷 Português (Brasil)

# english
source: 🇺🇸 English (US)
pt: 🇺🇸 Inglês (EUA)

# highContrast
source: High Contrast Mode
pt: Modo de Alto Contraste

source: Bold Text
pt: Texto em Negrito

source: Font Size
pt: Tamanho da Fonte

source: Scale:
pt: Escala:

# informAccessibility
source: Provide accessibility information?
pt: Informar dados de acessibilidade?

# alreadyHaveAccount
source: Already have an account?
pt: Já tem uma conta?

source: Generate resume
pt: Gerar currículo

source: Expand
pt: Expandir

source: Draft
pt: Rascunho

source: Print
pt: Imprimir

# includePCDInfo
source: Include disability info in the resume
pt: Incluir informações de PCD no currículo

# selectLanguagePrompt
source: Select Language:
pt: Selecione o Idioma:

source: 🇪🇸 Spanish
pt: 🇪🇸 Espanhol

source: 🇫🇷 French
pt: 🇫🇷 Fracês

source: 🇩🇪 German
pt: 🇩🇪 Alemão

# saveError
source: Error: Could not save. Please try again later...
pt: Erro: Não foi possível salvar. Tente mais tarde...

# saveSuccess
source: Resume saved successfully!
pt: Currículo salvo com sucesso!

# saveErrorPrefix
source: Error saving:
pt: Erro ao salvar:

source: Save Draft
pt: Salvar Rascunho

source: Save and Finalize
pt: Salvar e Finalizar

source: No certificates
pt: Nenhum certificado

source: No education
pt: Nenhuma formação

source: No projects
pt: Nenhum projeto

source: Preview/Print
pt: Preview/Imprimir

# fillBeforePreview
source: Fill the resume before printing/preview...
pt: Preencha o CV antes de imprimir/pré-visualizar...

# currentPlan
source: Your Current Plan
pt: Seu Plano Atual

source: Create New
pt: Criar Novo

source: Welcome!
pt: Bem-vindo!

# loginOrCreateAccount
source: Log in or sign up
pt: Faça login ou cadastre-se

# templateLoadError
source: Error loading templates
pt: Erro ao carregar templates

# selectTemplate
source: Select a template
pt: Selecione um template

# noProjectsInserted
source: No registered projects
pt: Sem projetos registrados

# noGraduationsInserted
source: No registered graduations
pt: Sem graduações registradas

# noSkillInserted
source: No registered skills
pt: Nenhuma Habilidade adicionada

# noExperiencesInserted
source: No registered experiences
pt: Sem experiências registradas

# noCertificatesinserted
source: No registered certificates
pt: Sem certificados registrados

# failToLoadUserProfile
source: Failed to load user's profile
pt: Erro ao carregar perfil

# experimenteAgora
source: Try it now!
pt: Experimente agora

# muteAndDeafMode
source: Deaf/Mute Version (Sign language)
pt: Versão em Libras (VLibras)

# projectsEmptyPlaceholder
source: Your projects will appear here.
pt: Seus projetos aparecerão aqui.

# experiencesEmptyPlaceholder
source: Yours experiencies will be here.
pt: Suas experiências aparecerão aqui.

# educationsEmptyPlaceholder
source: Yours graduations will be here.
pt: Suas graduações aparecerão aqui.

# skillsEmptyPlaceholder
source: Yours skills will be here.
pt: Suas habilidades aparecerão aqui.

# socialLinksEmptyPlaceholder
source: Yours socials will be here.
pt: Seus links de contato aparecerão aqui.

# certificatesEmptyPlaceholder
source: Yours certificates will be here.
pt: Seus certificados aparecerão aqui.

source: Appearance and Behavior
pt: Aparência e Comportamento

source: Accessibility
pt: Acessibilidade

source: About and Support
pt: Sobre e Suporte

# login_invalidEmailForReset
source: Please enter a valid email to reset your password.
pt: Por favor, insira um e-mail válido para redefinir a senha.

# login_resetEmailSent
source: A reset email has been sent to {email}.
pt: Um e-mail de redefinição foi enviado para {email}.

# login_logoSemanticLabel
source: IntelliResume Logo
pt: Logo do IntelliResume

# login_welcomeBack
source: Welcome back! Please log in.
pt: Bem-vindo de volta! Acesse sua conta.

# login_showPasswordTooltip
source: Show password
pt: Mostrar senha

# login_hidePasswordTooltip
source: Hide password
pt: Ocultar senha

# login_noAccount
source: Don't have an account?
pt: Não tem uma conta?

# sideBarMenu_welcome
source: Welcome!
pt: Bem-vindo!

# sideBarMenu_loginOrCreateAccount
source: Log in or sign up
pt: Faça login ou cadastre-se

# sideBarMenu_errorLoadingProfile
source: Error loading profile
pt: Erro ao carregar perfil

# sideBarMenu_home
source: Home
pt: Início

# sideBarMenu_profile
source: Profile
pt: Perfil

# sideBarMenu_history
source: History
pt: Histórico

# sideBarMenu_newCV
source: New CV
pt: Novo CV

# sideBarMenu_settings
source: Settings
pt: Configurações

# sideBarMenu_logout
source: Logout
pt: Sair

# home_greeting
source: Hello, {name}!
pt: Olá, {name}!

# home_greetingFallback
source: Hello!
pt: Olá!

# home_welcomeBackPrompt
source: Welcome back. Ready to conquer your next job?
pt: Bem-vindo de volta. Pronto para conquistar sua próxima vaga?

# home_yourResumes
source: Your Resumes
pt: Seus Currículos

# home_couldNotLoadResumes
source: Could not load resumes.
pt: Não foi possível carregar os currículos.

# home_quickActions
source: Quick Actions
pt: Ações Rápidas

# home_viewFullHistory
source: View Full History
pt: Ver Histórico Completo

# home_historyIconSemanticLabel
source: History icon
pt: Ícone de histórico

# home_exploreTemplates
source: Explore Templates
pt: Explorar Modelos

# home_paletteIconSemanticLabel
source: Color palette icon
pt: Ícone de paleta de cores

# home_mySubscription
source: My Subscription
pt: Minha Assinatura

# home_premiumIconSemanticLabel
source: Premium subscription icon
pt: Ícone de assinatura premium

# home_settings
source: Settings
pt: Ajustes

# home_settingsIconSemanticLabel
source: Settings icon
pt: Ícone de configurações

# signup_createAccountPrompt
source: Create your account to get started.
pt: Crie sua conta para começar a usar.

# signup_fullNameLabel
source: Full Name
pt: Nome Completo

# signup_disabilityInfoSemanticLabel
source: Option to provide accessibility or disability information.
pt: Opção para informar dados de acessibilidade ou deficiência.

# signup_informDisabilityQuestion
source: Provide accessibility information?
pt: Informar dados de acessibilidade?

# signup_disabilityDescriptionLabel
source: Description (optional)
pt: Descrição (opcional)

# signup_disabilityDescriptionHelper
source: Ex: I need a Libras interpreter.
pt: Ex: Necessito de intérprete de Libras.

# resumeForm_unauthenticatedUser
source: Unauthenticated user.
pt: Usuário não autenticado.

# resumeForm_failedToLoadResume
source: Failed to load resume: {error}
pt: Falha ao carregar o currículo: {error}

# resumeForm_eyeIconSemanticLabel
source: Eye icon
pt: Ícone de olho

# exportButtons_print
source: Print
pt: Imprimir

# template_projects
source: Projects
pt: Projetos

# template_noProjects
source: No projects added.
pt: Nenhum projeto adicionado.

# template_current
source: Current
pt: Atual

# template_certificates
source: Certificates
pt: Certificados

# template_noCertificates
source: No certificates added.
pt: Nenhum certificado adicionado.

# template_workload
source: Workload:
pt: Carga horária:

# template_defaultIntelliResume
source: IntelliResume Default
pt: Padrão IntelliResume

# template_downloadFailed
source: Download failed
pt: Falha no download

# template_socialLinks
source: Links and Social Networks
pt: Links e Redes Sociais

# template_additionalInfo
source: Additional Information
pt: Informações Adicionais

# template_classicMinimalist
source: Classic Minimalist
pt: Clássico Minimalista

# template_objective
source: Objective
pt: Objetivo

# template_noExperienceRegistered
source: No experience registered
pt: Nenhuma experiência registrada

# template_graduation
source: Graduation
pt: Graduação

# template_noGraduationsRegistered
source: No graduations registered
pt: Nenhuma graduação registrada

# template_skills
source: Skills
pt: Habilidades

# template_noSkillsRegistered
source: No skills registered
pt: Nenhuma habilidade registrada

# template_modernSidebar
source: Modern with Sidebar
pt: Moderno com Sidebar

# template_yourName
source: YOUR NAME
pt: SEU NOME

# template_profile
source: Profile
pt: Perfil

# template_experience
source: Experience
pt: Experiência

# template_jobTitle
source: JOB TITLE
pt: CARGO

# template_company
source: Company
pt: Empresa

# template_present
source: Present
pt: Atual

# template_education
source: Education
pt: Educação

# template_degreeCourse
source: DEGREE / COURSE
pt: CURSO / GRADUAÇÃO

# template_institution
source: Institution
pt: Instituição

# template_projectName
source: PROJECT NAME
pt: NOME DO PROJETO

# template_certificateName
source: CERTIFICATE NAME
pt: NOME DO CERTIFICADO

# template_timeline
source: Timeline
pt: Linha do Tempo

# template_visualInfographic
source: Visual Infographic
pt: Infográfico Visual

# template_contact
source: Contact
pt: Contato

# template_summary
source: Summary
pt: Resumo

# template_professionalExperience
source: Professional Experience
pt: Experiência Profissional

# template_academicBackground
source: Academic Background
pt: Formação Acadêmica

# template_ongoing
source: ongoing
pt: cursando

# template_beginner
source: Beginner
pt: Iniciante

# template_basic
source: Basic
pt: Básico

# template_intermediate
source: Intermediate
pt: Intermediário

# template_advanced
source: Advanced
pt: Avançado

# template_fluent
source: Fluent
pt: Fluente

# template_elegantCorporate
source: Elegant Corporate
pt: Corporativo Elegante

# template_professionalSummary
source: Professional Summary
pt: Resumo Profissional

# template_stacksTechnologies
source: Stacks & Technologies
pt: Stacks & Tecnologias

# template_noSkillAdded
source: No Skill added
pt: Nenhuma Skill adicionada

# template_developer
source: Developer
pt: Desenvolvedor

# template_nameNotFound
source: Name not found
pt: Nome não informado

# template_softwareEngineeringStudent
source: Software Engineering Student
pt: Estudante de Engenharia de Software

# template_noExperience
source: No registered experiences
pt: Sem experiências registradas

# template_courses
source: Courses
pt: Cursos

# template_noCertificatesRegistered
source: No registered certificates
pt: Sem certificados registrados

# template_noSkills
source: No registered skills
pt: Sem habilidades registradas

# template_noProjectsRegistered
source: No registered projects
pt: Sem projetos registrados

# template_aboutMe
source: About Me
pt: Sobre Mim

# template_aboutMeDefault
source: Software Engineering student with a solid academic background and practical experience in developing web and mobile applications.
pt: Estudante de Engenharia de Software com sólida formação acadêmica e experiência prática em desenvolvimento de aplicações web e móveis.

# template_firstJob
source: First Job
pt: Primeiro emprego

# template_workExperience
source: Work Experience
pt: Experiência de Trabalho

# template_languages
source: Languages
pt: Idiomas

# template_international
source: International
pt: Internacional

# preview_noCertificates
source: No certificates
pt: Nenhum certificado

# preview_certificateSemanticLabel
source: Certificate {index}: {courseName}. Tap to edit.
pt: Certificado {index}: {courseName}. Toque para editar.

# preview_current
source: Current
pt: Atual

# preview_noEducation
source: No education
pt: Nenhuma formação

# preview_educationSemanticLabel
source: Education {index}: {degree} in {school}. Tap to edit.
pt: Formação {index}: {degree} em {school}. Toque para editar.

# preview_noExperience
source: No experience
pt: Nenhuma experiência

# preview_experienceSemanticLabel
source: Experience {index}: {company} in {position}. Tap to edit.
pt: Experiência {index}: {company} em {position}. Toque para editar.

# preview_noProjects
source: No projects
pt: Nenhum projeto

# preview_projectSemanticLabel
source: Project {index}: {name}. Tap to edit.
pt: Projeto {index}: {name}. Toque para editar.

# preview_socialLinkSemanticLabel
source: Open {platform} profile. Link to {url}
pt: Abrir perfil em {platform}. Link para {url}

# preview_couldNotOpenURL
source: Could not open URL: {url}
pt: Não foi possível abrir a URL: {url}

# recentResume_semanticLabel
source: Resume: {title}, tap to edit
pt: Currículo: {title}, toque para editar

# recentResume_iconSemanticLabel
source: Resume icon
pt: Ícone de currículo

# recentResume_untitled
source: Untitled Resume
pt: Currículo sem título

# recentResume_draft
source: Draft
pt: Rascunho

# recentResume_finalized
source: Finalized
pt: Finalizado

# recentResume_editedOn
source: Edited on: {date}
pt: Editado em: {date}

# addNewResume_semanticLabel
source: Create New Resume, tap to start
pt: Criar Novo Currículo, toque para iniciar

# addNewResume_iconSemanticLabel
source: Add new resume icon
pt: Ícone de adicionar novo currículo

# addNewResume_create
source: Create New
pt: Criar Novo

# templateSelector_errorLoadingTemplates
source: Error loading templates
pt: Erro ao carregar templates

# templateSelector_selectTemplate
source: Select a template
pt: Selecione um template

# buyPage_premiumSuccess
source: Premium plan activated successfully!
pt: Plano Premium ativado com sucesso!

# buyPage_genericError
source: Error: {error}
pt: Erro: {error}

# editProfile_userProfileNotFound
source: User profile not found.
pt: Perfil do usuário não encontrado.

# editProfile_uidNotFoundForImageUpload
source: User UID not found for image upload.
pt: UID do usuário não encontrado para upload de imagem.

# editProfile_profileUpdatedSuccessfully
source: Profile updated successfully!
pt: Perfil atualizado com sucesso!

# editProfile_errorUpdatingProfile
source: Error updating profile: {error}
pt: Erro ao atualizar perfil: {error}

# editProfile_editProfile
source: Edit Profile
pt: Editar Perfil

# editProfile_name
source: Name
pt: Nome

# editProfile_phone
source: Phone
pt: Telefone

# editProfile_fieldRequired
source: This field is required
pt: Este campo é obrigatório

# editProfile_accessibilityAndInclusion
source: Accessibility and Inclusion
pt: Acessibilidade e Inclusão

# editProfile_informPCD
source: I wish to inform that I am a person with a disability
pt: Desejo informar que sou PCD

# editProfile_pcdInfoOptional
source: This information is optional and will be used for affirmative action vacancies.
pt: Esta informação é opcional e será usada para vagas afirmativas.

# editProfile_disabilityTypes
source: Disability Types (select one or more)
pt: Tipos de Deficiência (selecione uma ou mais)

# editProfile_physicalDisability
source: Physical
pt: Física

# editProfile_auditoryDisability
source: Auditory
pt: Auditiva

# editProfile_intellectualDisability
source: Intellectual
pt: Intelectual

# editProfile_multipleDisabilities
source: Multiple
pt: Múltipla

# editProfile_descriptionOrCIDOptional
source: Description or CID (optional)
pt: Descrição ou CID (opcional)

# editProfile_selectProfilePicture
source: Select profile picture
pt: Selecionar foto de perfil

# editProfile_saving
source: Saving...
pt: Salvando...

# editProfile_saveChanges
source: Save Changes
pt: Salvar Alterações

# exportPage_chooseTemplate
source: 1. Choose Template
pt: 1. Escolha o Modelo

# exportPage_defaultTemplateDescription
source: Our standard, balanced and professional template.
pt: Nosso modelo padrão, balanceado e profissional.

# exportPage_classicTemplateDescription
source: A clean and classic design, focused on content.
pt: Um design limpo e clássico, focado no conteúdo.

# exportPage_studentFirstJobTemplateDescription
source: Ideal for students and first jobs.
pt: Ideal para estudantes e primeiro emprego.

# exportPage_modernSideTemplateDescription
source: A modern layout with an elegant sidebar.
pt: Um layout moderno com uma barra lateral elegante.

# exportPage_internationalTemplateDescription
source: Universal format, ready for translation.
pt: Formato universal, pronto para tradução.

# exportPage_devTecTemplateDescription
source: Made for developers, highlighting skills and projects.
pt: Feito para desenvolvedores, destacando skills e projetos.

# exportPage_professionalTemplateDescription
source: A professional template for your resume.
pt: Um modelo profissional para o seu currículo.

# exportPage_customizeOptional
source: 2. Customize (Optional)
pt: 2. Personalize (Opcional)

# exportPage_generateAndPreviewPDF
source: Generate and Preview PDF
pt: Gerar e Visualizar PDF

# exportPage_generateAndPreviewPDFTooltip
source: Generate and preview the resume in PDF format
pt: Gerar e visualizar o currículo em formato PDF

# exportPage_errorGeneratingPDF
source: Error generating PDF: {error}
pt: Erro ao gerar PDF: {error}

# exportPage_premiumTemplate
source: Premium Template
pt: Template Premium

# exportPage_premiumTemplateMessage
source: This template is only available on Premium or Pro plans. Upgrade to use this and many other features!
pt: Este template está disponível apenas nos planos Premium ou Pro. Faça o upgrade para usar este e muitos outros recursos!

# exportPage_close
source: Close
pt: Fechar

# exportPage_viewPlans
source: View Plans
pt: Ver Planos

# exportPage_error
source: Error: {error}
pt: Erro: {error}

# exportPage_free
source: Free
pt: Grátis

# exportPage_selectLanguage
source: Select a language...
pt: Selecione um idioma...

# exportPage_english
source: English (English)
pt: Inglês (English)

# exportPage_spanish
source: Spanish (Español)
pt: Espanhol (Español)

# exportPage_french
source: French (Français)
pt: Francês (Français)

# exportPage_translateResume
source: Translate resume
pt: Traduzir currículo

# exportPage_contentWillBeTranslated
source: The content will be translated.
pt: O conteúdo será traduzido.

# exportPage_availableOnlyInternational
source: Available only for the International template.
pt: Disponível apenas para o modelo Internacional.

# exportPdfPage_previewPdf
source: Preview PDF
pt: Pré-visualizar PDF

# exportPdfPage_print
source: Print
pt: Imprimir

# exportPdfPage_download
source: Download
pt: Baixar

# historyPage_myResumes
source: My Resumes
pt: Meus Currículos
